W10/background/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
//    #includeEtc "caseDicts/setConstraintTypes"

    inlet
    {
        type            waveVelocity;
        value           uniform (0 0 0);
    }
	
    outlet
    {
        type            waveVelocity;
        value           uniform (0 0 0);
    }

    walls
    {
        type            slip;
    }
	
    ground
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    atmosphere
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }

    floatingObject
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }

    overset
    {
	type		overset;
    }

    sides
    {
	type		overset;
    }
}


// ************************************************************************* //
